database/mysql-index.org
#+TITLE: MySQL 索引笔记
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2021-07-03 Sat 09:36:10>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+PROPERTY: header-args:sql :dbhost 127.0.0.1 :database test01 :engine mysql :dbuser user01 :dbpassword user01 :dbport 3306


* 准备测试表
  构建测试表 ~author~, 建表语句如下
  #+BEGIN_SRC sql
    drop table if exists author;
    create table author (
      id int auto_increment primary key,
      name varchar(128) not null,
      age int,
      gender varchar(32),
      a int,
      b int,
      c int
    );
  #+END_SRC

  准备测试数据
  #+BEGIN_SRC sql
    insert into author(name, age, gender, a, b, c) values ('aaa', 11, 'M', 1, 1, 1);
    insert into author(name, age, gender, a, b, c) values ('aab', 12, 'M', 1, 1, 2);
    insert into author(name, age, gender, a, b, c) values ('abc', 10, 'F', 1, 2, 3);
    insert into author(name, age, gender, a, b, c) values ('bba', 22, 'M', 2, 2, 1);
    insert into author(name, age, gender, a, b, c) values ('bcb', 42, 'F', 2, 3, 2);
    insert into author(name, age, gender, a, b, c) values ('bcc', 12, 'M', 2, 3, 3);
    insert into author(name, age, gender, a, b, c) values ('cba', 17, 'M', 3, 2, 1);
    insert into author(name, age, gender, a, b, c) values ('bcb', 32, 'F', 3, 1, 2);
    insert into author(name, age, gender, a, b, c) values ('bcc', 82, 'M', 3, 1, 3);
  #+END_SRC

  #+RESULTS:
  |---|

  #+BEGIN_SRC sql
    select * from author;
  #+END_SRC

  #+RESULTS:
  | id | name | age | gender | a | b | c |
  |----+------+-----+--------+---+---+---|
  |  1 | aaa  |  11 | M      | 1 | 1 | 1 |
  |  2 | aab  |  12 | M      | 1 | 1 | 2 |
  |  3 | abc  |  10 | F      | 1 | 2 | 3 |
  |  4 | bba  |  22 | M      | 2 | 2 | 1 |
  |  5 | bcb  |  42 | F      | 2 | 3 | 2 |
  |  6 | bcc  |  12 | M      | 2 | 3 | 3 |
  |  7 | cba  |  17 | M      | 3 | 2 | 1 |
  |  8 | bcb  |  32 | F      | 3 | 1 | 2 |
  |  9 | bcc  |  82 | M      | 3 | 1 | 3 |

  添加唯一性约束和联合索引
  #+BEGIN_SRC sql
    alter table author add unique key uk_author_nag (name, age, gender);
    create index ix_author_abc on author(a, b, c);
  #+END_SRC

  #+RESULTS:
  |---|

  查看准备好的表结构和索引键
  #+BEGIN_SRC sql
    show create table author\G
  #+END_SRC

  #+RESULTS:
  | *************************** 1. row ***************************                       |
  |--------------------------------------------------------------------------------------|
  | Table: author                                                                        |
  | Create Table: CREATE TABLE `author` (                                                |
  | `id` int(11) NOT NULL AUTO_INCREMENT,                                                |
  | `name` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,                             |
  | `age` int(11) DEFAULT NULL,                                                          |
  | `gender` varchar(32) COLLATE utf8mb4_unicode_ci DEFAULT NULL,                        |
  | `a` int(11) DEFAULT NULL,                                                            |
  | `b` int(11) DEFAULT NULL,                                                            |
  | `c` int(11) DEFAULT NULL,                                                            |
  | PRIMARY KEY (`id`),                                                                  |
  | UNIQUE KEY `uk_author_nag` (`name`,`age`,`gender`),                                  |
  | KEY `ix_author_abc` (`a`,`b`,`c`)                                                    |
  | ) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci |

  查看表结构
  #+BEGIN_SRC sql
    desc author;
  #+END_SRC

  #+RESULTS:
  | Field  | Type         | Null | Key | Default | Extra          |
  |--------+--------------+------+-----+---------+----------------|
  | id     | int(11)      | NO   | PRI | NULL    | auto_increment |
  | name   | varchar(128) | NO   | MUL | NULL    |                |
  | age    | int(11)      | YES  |     | NULL    |                |
  | gender | varchar(32)  | YES  |     | NULL    |                |
  | a      | int(11)      | YES  | MUL | NULL    |                |
  | b      | int(11)      | YES  |     | NULL    |                |
  | c      | int(11)      | YES  |     | NULL    |                |

  查看准备好的表索引信息
  #+BEGIN_SRC sql
    show index from author;
  #+END_SRC

  #+RESULTS:
  | Table  | Non_unique | Key_name      | Seq_in_index | Column_name | Collation | Cardinality | Sub_part | Packed | Null | Index_type | Comment | Index_comment |
  |--------+------------+---------------+--------------+-------------+-----------+-------------+----------+--------+------+------------+---------+---------------|
  | author |          0 | PRIMARY       |            1 | id          | A         |           9 | NULL     | NULL   |      | BTREE      |         |               |
  | author |          0 | uk_author_nag |            1 | name        | A         |           7 | NULL     | NULL   |      | BTREE      |         |               |
  | author |          0 | uk_author_nag |            2 | age         | A         |           9 | NULL     | NULL   | YES  | BTREE      |         |               |
  | author |          0 | uk_author_nag |            3 | gender      | A         |           9 | NULL     | NULL   | YES  | BTREE      |         |               |
  | author |          1 | ix_author_abc |            1 | a           | A         |           3 | NULL     | NULL   | YES  | BTREE      |         |               |
  | author |          1 | ix_author_abc |            2 | b           | A         |           6 | NULL     | NULL   | YES  | BTREE      |         |               |
  | author |          1 | ix_author_abc |            3 | c           | A         |           9 | NULL     | NULL   | YES  | BTREE      |         |               |

* 修改
