database/mysql-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-03 Sat 09:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL 索引笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">MySQL 索引笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ee6635">1. 准备测试表</a></li>
<li><a href="#orga63918a">2. 修改</a></li>
</ul>
</div>
</div>


<div id="outline-container-org9ee6635" class="outline-2">
<h2 id="org9ee6635"><span class="section-number-2">1</span> 准备测试表</h2>
<div class="outline-text-2" id="text-1">
<p>
构建测试表 <code>author</code>, 建表语句如下
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">drop</span> <span style="color: #859900;">table</span> <span style="color: #859900;">if</span> <span style="color: #859900;">exists</span> author;
<span style="color: #859900;">create</span> <span style="color: #859900;">table</span> <span style="color: #b58900;">author</span> (
  id <span style="color: #268bd2;">int</span> <span style="color: #859900;">auto_increment</span> <span style="color: #859900;">primary</span> <span style="color: #859900;">key</span>,
  <span style="color: #859900;">name</span> <span style="color: #268bd2;">varchar</span>(128) <span style="color: #859900;">not</span> <span style="color: #859900;">null</span>,
  age <span style="color: #268bd2;">int</span>,
  gender <span style="color: #268bd2;">varchar</span>(32),
  a <span style="color: #268bd2;">int</span>,
  b <span style="color: #268bd2;">int</span>,
  c <span style="color: #268bd2;">int</span>
);
</pre>
</div>

<p>
准备测试数据
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'aaa'</span>, 11, <span style="color: #2aa198;">'M'</span>, 1, 1, 1);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'aab'</span>, 12, <span style="color: #2aa198;">'M'</span>, 1, 1, 2);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'abc'</span>, 10, <span style="color: #2aa198;">'F'</span>, 1, 2, 3);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'bba'</span>, 22, <span style="color: #2aa198;">'M'</span>, 2, 2, 1);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'bcb'</span>, 42, <span style="color: #2aa198;">'F'</span>, 2, 3, 2);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'bcc'</span>, 12, <span style="color: #2aa198;">'M'</span>, 2, 3, 3);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'cba'</span>, 17, <span style="color: #2aa198;">'M'</span>, 3, 2, 1);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'bcb'</span>, 32, <span style="color: #2aa198;">'F'</span>, 3, 1, 2);
<span style="color: #859900;">insert</span> <span style="color: #859900;">into</span> author(<span style="color: #859900;">name</span>, age, gender, a, b, c) <span style="color: #859900;">values</span> (<span style="color: #2aa198;">'bcc'</span>, 82, <span style="color: #2aa198;">'M'</span>, 3, 1, 3);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">select</span> * <span style="color: #6c71c4;">from</span> author;
</pre>
</div>

<p>
添加唯一性约束和联合索引
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">alter</span> <span style="color: #859900;">table</span> <span style="color: #b58900;">author</span> <span style="color: #859900;">add</span> <span style="color: #859900;">unique</span> <span style="color: #859900;">key</span> uk_author_nag (<span style="color: #859900;">name</span>, age, gender);
<span style="color: #859900;">create</span> <span style="color: #859900;">index</span> ix_author_abc <span style="color: #859900;">on</span> author(a, b, c);
</pre>
</div>

<p>
查看准备好的表结构和索引键
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> <span style="color: #859900;">create</span> <span style="color: #859900;">table</span> author\G
</pre>
</div>

<p>
查看表结构
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">desc</span> author;
</pre>
</div>

<p>
查看准备好的表索引信息
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> <span style="color: #859900;">index</span> <span style="color: #6c71c4;">from</span> author;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga63918a" class="outline-2">
<h2 id="orga63918a"><span class="section-number-2">2</span> 修改</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-07-03 Sat 09:48. Created by Jinghui Hu at 2021-07-03 Sat 09:36.</p>
</div>
</body>
</html>
